#include "pch.h"
#include "Board.h"

Board::Board()
{
	/* Table Size = 10 x 10 -> 21 x 17 (Height x Width) */
	this->base = {
		{"¢°" ,"  " ,"¢±" ,"  " ,"¢²" ,"  " ,"¢³" ,"  " ,"¢´" ,"  " ,"¢µ" ,"  " ,"¢¶" ,"  " ,"¢·" ,"  " ,"¢¸" },
		{"שÝ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שß "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","¢@" ,"שר ","¡‏" ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","¡‏" ,"שר ","¢@" ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שג "},
		{"שר ","¡@" ,"·¡" ,"¡@" ,"¡@" ,"×e" ,"¡@" ,"¡@" ,"¡@" ,"¡@" ,"¡@" ,"÷~" ,"¡@" ,"¡@" ,"¬ֹ" ,"¡@" ,"שר "},
		{"שא ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שÞ ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","¢@" ,"שר ","¡‏" ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שא ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שב ","שש ","שג "},
		{"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר ","¡‏" ,"שר ","¢@" ,"שר ","  " ,"שר ","  " ,"שר ","  " ,"שר "},
		{"שד ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שה ","שש ","שו "},
		{"₪@" ,"  " ,"₪G" ,"  " ,"₪T" ,"  " ,"¥|" ,"  " ,"₪­" ,"  " ,"₪»" ,"  " ,"₪C" ,"  " ,"₪K" ,"  " ,"₪E" },
	};

	this->cursor = {
		{{3,3 } , {7,3 } , {11,3 } , {15,3 } , {19,3 } , {23,3 } , {27,3 } , {31,3 } , {35,3 }},
		{{3,5 } , {7,5 } , {11,5 } , {15,5 } , {19,5 } , {23,5 } , {27,5 } , {31,5 } , {35,5 }},
		{{3,7 } , {7,7 } , {11,7 } , {15,7 } , {19,7 } , {23,7 } , {27,7 } , {31,7 } , {35,7 }},
		{{3,9 } , {7,9 } , {11,9 } , {15,9 } , {19,9 } , {23,9 } , {27,9 } , {31,9 } , {35,9 }},
		{{3,11} , {7,11} , {11,11} , {15,11} , {19,11} , {23,11} , {27,11} , {31,11} , {35,11}},
		{{3,13} , {7,13} , {11,13} , {15,13} , {19,13} , {23,13} , {27,13} , {31,13} , {35,13}},
		{{3,15} , {7,15} , {11,15} , {15,15} , {19,15} , {23,15} , {27,15} , {31,15} , {35,15}},
		{{3,17} , {7,17} , {11,17} , {15,17} , {19,17} , {23,17} , {27,17} , {31,17} , {35,17}},
		{{3,19} , {7,19} , {11,19} , {15,19} , {19,19} , {23,19} , {27,19} , {31,19} , {35,19}},
		{{3,21} , {7,21} , {11,21} , {15,21} , {19,21} , {23,21} , {27,21} , {31,21} , {35,21}},
	};

	this->pointerX = 0;
	this->pointerY = 0;
}


Board::~Board()
{
}

void Board::print()
{
	Cmder::setCursor(3, 2);
	Cmder::setColor(CLI_BACK_BLACK | CLI_FONT_CYAN);
	COORD pos = Cmder::getCursor();
	for (auto& row : this->base)
	{
		
		for (auto& element : row)
		{
			cout << element;
		}
		Cmder::setCursor(pos.X, ++pos.Y);
	}
	/* ¶ֲ¦ג₪ט */
	Cmder::setColor(CLI_BACK_BLACK | CLI_FONT_RED | CLI_FONT_BLUE | CLI_FONT_LIGHT);
	Cmder::setCursor(3, 2);
	for (auto& element : this->base[0])
		cout << element;

	/* ¬ץ¦ג₪ט */
	Cmder::setColor(CLI_BACK_BLACK | CLI_FONT_RED | CLI_FONT_BLUE | CLI_FONT_LIGHT);
	Cmder::setCursor(3, 22);
	for(auto& element : this->base[20])
		cout << element;
	
	Cmder::setCursor(4, 21);
}

// ¿י¥X´ׁ₪l
void Board::put(Chess* chess)
{
	/* ¸׃´ׁ₪l¬°¬¡ */
	if (chess->isLife() == true)
	{
		Cmder::setColor();
		

		//¶ֲ₪ט
		if (chess->getID() <= 7)
			Cmder::setColor(CLI_FONT_BLACK | CLI_FONT_LIGHT);

		//¬ץ₪ט
		else
			Cmder::setColor(CLI_FONT_RED);

		//³Q¿ן¾Ü
		if (chess->isCurrent())
			Cmder::setColor(CLI_FONT_YELLOW | CLI_BACK_BLACK | CLI_BACK_LIGHT);

		COORD pos = chess->getPosition();
		Cmder::setCursor(this->cursor[pos.Y][pos.X]);
		cout << chess->getName();
		Cmder::setColor();
	}
}

// ³]©w´ו¼׀¦bCLI×÷¦ל¸m
void Board::setPointer(int dx , int dy)
{
	this->pointerX = (this->pointerX + dx) % 9;
	this->pointerY = (this->pointerY + dy) % 10;
}

// ¨ת±o´ו¼׀¦bCLI×÷¦ל¸m
COORD Board::getPointer()
{
	return { this->cursor[this->pointerY][this->pointerX] };
}

// ¨ת±o´ו¼׀¦b´ׁ½L×÷®y¼׀
COORD Board::getCursor()
{
	return { this->pointerX ,this->pointerY };
}