#include "pch.h"
#include "Board.h"

Board::Board()
{
	this->state = {
		{"¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×¡×"},
		{"¡U¨B¡@¡@¼Æ¡@¡U¡@¬õ¡@¡@¤è¡@¡U¡@¶Â¡@¡@¤è¡U"},
		{"¡U1.        ¡U  ¬¶¤G¥­¤­  ¡U  °¨¢·¶i¢¶¡U"},
		{"¡U2.        ¡U  ØX¤G¶i¤T  ¡U¡@¬¶¢·¥­¢¸¡U"},
		{"¡U3.        ¡U  ØX¤K¶i¤C¡@¡U¡@¨®¢¸¥­¢·¡U"},
	};
	/* Table Size = 10 x 10 -> 21 x 17 */
	this->base = {
		{"¢°" ,"  " ,"¢±" ,"  " ,"¢²" ,"  " ,"¢³" ,"  " ,"¢´" ,"  " ,"¢µ" ,"  " ,"¢¶" ,"  " ,"¢·" ,"  " ,"¢¸" },
		{"ùÝ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùß "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","¢@" ,"ùø ","¡þ" ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","¡þ" ,"ùø ","¢@" ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùâ "},
		{"ùø ","¡@" ,"·¡" ,"¡@" ,"¡@" ,"ªe" ,"¡@" ,"¡@" ,"¡@" ,"¡@" ,"¡@" ,"º~" ,"¡@" ,"¡@" ,"¬É" ,"¡@" ,"ùø "},
		{"ùà ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùÞ ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","¢@" ,"ùø ","¡þ" ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùà ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùá ","ùù ","ùâ "},
		{"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø ","¡þ" ,"ùø ","¢@" ,"ùø ","  " ,"ùø ","  " ,"ùø ","  " ,"ùø "},
		{"ùã ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùä ","ùù ","ùå "},
		{"¤@" ,"  " ,"¤G" ,"  " ,"¤T" ,"  " ,"¥|" ,"  " ,"¤­" ,"  " ,"¤»" ,"  " ,"¤C" ,"  " ,"¤K" ,"  " ,"¤E" },
	};
}


Board::~Board()
{
}

void Board::print()
{
	for (auto& row : this->base)
	{
		for (auto& element : row)
		{
			cout << element;
		}
		cout << '\n';
	}
}


void Board::put(Position pos)
{
}

void Board::put(int x, int y)
{

}